Ondulab/CISYNTH_MOD-747DISCO/SSS_MOD-747DISCO.ioc
#MicroXplorer Configuration settings - do not modify
LWIP0.BSP.mode=
PF7.GPIOParameters=GPIO_Label,PinAttribute
PD7.Mode=IN0
DSI_CKN.Mode=DSIHost_Video
PB13.GPIOParameters=GPIO_Label,PinAttribute
LWIP.LWIP_PERF=1
SH.FMC_D0_DA0.ConfNb=1
PI7.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_A8.ConfNb=1
SH.FMC_A0.ConfNb=1
SH.FMC_D6_DA6.ConfNb=1
SH.FMC_D9_DA9.ConfNb=1
SH.FMC_A0.0=FMC_A0,13b-sda1
PE11.GPIOParameters=GPIO_Label,PinAttribute
PH15.GPIO_Label=FMC_D23
PH0-OSC_IN\ (PH0).PinAttribute=CortexM7
NVIC2.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PI10.PinAttribute=CortexM7
PG8.Signal=FMC_SDCLK
PG8.Locked=true
PG0.Locked=true
PI15.Locked=true
PG0.Signal=FMC_A10
RCC.PLLFRACN=0
PC3_C.Mode=IN1-Single-Ended
PD8.Locked=true
DAC1.IPParameters=DAC_Channel-DAC_OUT1
SAI1.Instance-SAI_A_MasterWithClock=SAI$Index_Block_A
PI15.GPIO_Label=LED4
RCC.RTCFreq_Value=32000
PA5.PinAttribute=CortexM7
RCC.PLLDSIFreq_Value=250000000
PD0.Locked=true
RCC.CpuClockFreq_Value=480000000
PD2.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_SDNWE.ConfNb=1
PG14.GPIOParameters=GPIO_Label,PinAttribute
PK1.Signal=SPI5_NSS
USART1.IPParameters=VirtualMode-Asynchronous
SH.FMC_D5_DA5.0=FMC_D5,sd-32b-d1
PA2.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PG2.GPIOParameters=GPIO_Label,PinAttribute
USB_OTG_HS.VirtualMode-Device_HS=Device_HS
DSI_D1N.Mode=DSIHost_Video
PB6.PinAttribute=CortexM7
SH.FMC_D9_DA9.0=FMC_D9,sd-32b-d1
RCC.LPTIM1Freq_Value=120000000
SH.FMC_D25.0=FMC_D25,sd-32b-d1
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_ENABLE
SH.FMC_NBL2.ConfNb=1
PG15.GPIO_Label=FMC_SDCAS
PF7.Signal=QUADSPI_BK1_IO2
RCC.PLL3_VCI_Range=RCC_PLL3VCIRANGE_0
SH.FMC_SDNWE.0=FMC_SDNWE,13b-sda1
NVIC1.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
PI11.PinAttribute=CortexM7
RCC.ADCCLockSelection=RCC_ADCCLKSOURCE_CLKP
PH9.Signal=FMC_D17
SH.FMC_D11_DA11.0=FMC_D11,sd-32b-d1
RCC.I2C4Freq_Value=120000000
PB6.Signal=CEC
PD0.Signal=FMC_D2_DA2
PD8.Signal=FMC_D13_DA13
PE1.Signal=FMC_NBL1
PE14.Locked=true
ProjectManager.ProjectBuild=false
PC8.PinAttribute=CortexM7
PJ12.GPIOParameters=GPIO_Label,PinAttribute
PA8.Locked=true
PF1.GPIO_Label=FMC_A1
PK4.GPIO_Label=JOY_LEFT
PI4.GPIO_Label=FMC_NBL2
PJ10.GPIOParameters=GPIO_Label,PinAttribute
PD1.GPIO_Label=FMC_D3
PB12.GPIO_Label=ULPI_D5
PG14.Mode=Dual_Bank
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
PF12.GPIO_Label=FMC_A6
PI7.Locked=true
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=240000000
NVIC1.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC4.GPIO_Label=ETH_RXD0
RCC.SAI1CLockSelection=RCC_SAI1CLKSOURCE_PLL2
PG12.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PE9.Signal=FMC_D6_DA6
PI2.Locked=true
SH.FMC_A2.0=FMC_A2,13b-sda1
PE9.Locked=true
PD8.PinAttribute=CortexM7
PB1.GPIO_Label=ULPI_D2
PI12.PinAttribute=Free
RCC.USART16Freq_Value=120000000
PE4.GPIO_Label=SAI1_FS_A
PG4.GPIO_Label=FMC_BA0
PC9.Mode=SD_4_bits_Wide_bus
PF10.Locked=true
PF13.Locked=true
VP_SYS_M4_VS_Systick.Mode=SysTick
PI15.GPIOParameters=GPIO_Label,PinAttribute
PA8.Signal=RCC_MCO_1
PF2.Locked=true
PE1.Locked=true
CortexM7.Pins=PJ0,PJ3
SH.FMC_D1_DA1.0=FMC_D1,sd-32b-d1
PB6.Locked=true
RCC.PLL2_VCO_SEL-AdvancedSettings=RCC_PLL2VCOWIDE
USB_OTG_HS.IPParameters=VirtualMode-Device_HS
PA3.PinAttribute=CortexM7
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=49142857.14285714
PA7.PinAttribute=CortexM7
Mcu.Package=TFBGA240
SAI1.AudioFrequency-SAI_A_MasterWithClock=SAI_AUDIO_FREQUENCY_48K
PB1.Signal=USB_OTG_HS_ULPI_D2
PA5.Locked=true
SPI2.Mode=SPI_MODE_MASTER
PB15.PinAttribute=Free
PJ11.Locked=true
RCC.PLL3FRACN=0
DSI_D0P.Mode=DSIHost_Video
SH.FMC_SDNCAS.ConfNb=1
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PJ8.Locked=true
PC3_C.GPIO_Label=ARD_A5
SH.FMC_A11.ConfNb=1
SH.FMC_D27.0=FMC_D27,sd-32b-d1
PA10.Signal=USART1_RX
PJ3.Locked=true
PE12.GPIO_Label=FMC_D9
PH6.Locked=true
PC11.Mode=SD_4_bits_Wide_bus
PF7.Locked=true
Mcu.Context0=CortexM7
Mcu.Context1=CortexM4
PH9.Locked=true
SPI5.CalculateBaudRate=60.0 MBits/s
PD7.PinAttribute=CortexM7
PC14-OSC32_IN\ (OSC32_IN).Mode=LSE-External-Oscillator
RCC.LPUART1Freq_Value=120000000
PF10.Mode=IN6-Single-Ended
DSI_CKP.GPIOParameters=PinAttribute
PB13.Mode=Device_HS
PE6.Locked=true
PJ0.Locked=true
PK1.Locked=true
PD15.Signal=FMC_D1_DA1
PJ1.GPIO_Label=OTG_HS_OverCurrent
RCC.VCO3OutputFreq_Value=960000000
SH.FMC_D3_DA3.ConfNb=1
PG12.Signal=ETH_TXD1
PA5.Mode=Device_HS
PG12.PinAttribute=CortexM7
Mcu.Pin80=PC0
Mcu.Pin81=PF10
PK4.Signal=GPIO_Input
SH.FMC_A4.0=FMC_A4,13b-sda1
ProjectManager.ProjectFileName=SSS_MOD-747DISCO.ioc
SH.FMC_A5.ConfNb=1
PH13.Locked=true
PH13.Signal=FMC_D21
LWIP0.BSP.i2caddr=0
Mcu.Pin79=DSI_D1N
PA0_C.Locked=true
ADC3.OffsetNumber-1\#ChannelRegularConversion=ADC_OFFSET_NONE
PI10.Locked=true
Mcu.PinsNb=165
PA1.PinAttribute=CortexM7
PC14-OSC32_IN\ (OSC32_IN).GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin73=PK1
Mcu.Pin74=PF6
Mcu.Pin71=PF4
Mcu.Pin72=PK0
PC13.Locked=true
Mcu.Pin77=PJ11
SAI1.MClockEnable-SAI_A_MasterWithClock=SAI_MASTERCLOCK_ENABLE
Mcu.Pin78=DSI_D1P
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
Mcu.Pin75=PF7
PA1_C.GPIO_Label=ARD_A3
PC13.Signal=RTC_TAMP1
PG3.Locked=true
Mcu.Pin76=PF8
SH.FMC_D10_DA10.0=FMC_D10,sd-32b-d1
Mcu.Pin70=PF5
PG9.Mode=Dual_Bank
PC2.Signal=SPI2_MISO
PF9.PinAttribute=CortexM7
PI12.Signal=GPIO_Output
SAI1.ErrorAudioFreq-SAI_A_MasterWithClock=-0.01 %
SH.FMC_D16.0=FMC_D16,sd-32b-d1
Mcu.Pin68=PH1-OSC_OUT (PH1)
Mcu.Pin69=PH0-OSC_IN (PH0)
PE8.PinAttribute=CortexM7
PB14.Locked=true
Mcu.Pin62=PI14
PG14.Locked=true
Mcu.Pin63=PF3
Mcu.Pin60=PI12
Mcu.Pin61=PI13
PA9.PinAttribute=CortexM7
Mcu.Pin66=PG2
RCC.PWR_Regulator_Voltage_Scale=PWR_REGULATOR_VOLTAGE_SCALE0
Mcu.Pin67=PK2
Mcu.Pin64=PG4
Mcu.Pin65=PG3
PG13.PinAttribute=CortexM7
PJ11.Signal=SPI5_MISO
PF8.GPIO_Label=PMOD\#14/ARD_D3
ETH.IPParameters=MediaInterface
PC3.GPIOParameters=GPIO_Label,PinAttribute
PD10.Signal=FMC_D15_DA15
RCC.D1CPREFreq_Value=480000000
PA3.Mode=Device_HS
PB2.PinAttribute=CortexM7
PJ8.GPIO_Label=ARD_D1
PJ3.Signal=GPIO_Input
RCC.Tim1OutputFreq_Value=240000000
PI8.GPIO_Label=uSD_Detect
PA8.GPIO_Label=CEC_CK/MCO1
DSI_D0N.Signal=DSIHOST_D0N
SH.FMC_D29.0=FMC_D29,sd-32b-d1
Mcu.Pin59=PG6
Mcu.Pin57=PF1
PC15-OSC32_OUT\ (OSC32_OUT).Locked=true
Mcu.Pin58=PF0
PH11.GPIOParameters=GPIO_Label,PinAttribute
PA2.PinAttribute=CortexM7
PH4.Locked=true
Mcu.Pin51=PA11
Mcu.Pin52=PI10
Mcu.Pin50=PA12
SH.COMP_DAC11_group.0=DAC1_OUT1,DAC_OUT1
RCC.PLLDSIVCOFreq_Value=500000000
Mcu.Pin55=PG7
PA0_C.GPIO_Label=ARD_A2
Mcu.Pin56=PF2
Mcu.Pin53=PI11
Mcu.Pin54=PG8
PE8.GPIO_Label=FMC_D5
PH11.GPIO_Label=FMC_D19
SH.ADCx_INP1.ConfNb=1
PB11.GPIOParameters=GPIO_Label,PinAttribute
PI12.Locked=true
PJ11.GPIO_Label=ARD_D12
PI3.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin48=PC9
Mcu.Pin49=PA8
LWIP0.BSP.ip=
PH13.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin46=PD1
Mcu.Pin47=PC8
SAI1.VirtualMode-SAI_A_MasterWithClock=VM_MASTER
TIM13.IPParameters=Channel
PF3.GPIOParameters=GPIO_Label,PinAttribute
PG6.GPIOParameters=GPIO_Label,PinAttribute
PJ6.GPIOParameters=GPIO_Label,PinAttribute
PB14.Signal=GPIO_Input
Mcu.Pin40=PH13
PA5.Signal=USB_OTG_HS_ULPI_CK
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_ENABLE
Mcu.Pin41=PI9
PE13.GPIOParameters=GPIO_Label,PinAttribute
PC12.Mode=SD_4_bits_Wide_bus
Mcu.Pin44=PE6
Mcu.Pin45=PJ13
Mcu.Pin42=PC13
PG11.PinAttribute=CortexM7
Mcu.Pin43=PI8
PJ4.GPIO_Label=ARD_D4
DSI_D1N.Signal=DSIHOST_D1N
VP_LTDC_DSIMode.Signal=LTDC_DSIMode
PE1.GPIO_Label=FMC_NBL1
PG9.PinAttribute=CortexM7
PK7.GPIO_Label=TOUCH_INT
PI7.Signal=FMC_D29
PB1.PinAttribute=CortexM7
PC2_C.GPIO_Label=ARD_A4
SH.FMC_A6.0=FMC_A6,13b-sda1
NVIC2.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.AHB12Freq_Value=240000000
PE14.Signal=FMC_D11_DA11
PE6.Mode=SAI_A_MasterWithClock
Mcu.Pin37=PD0
Mcu.Pin38=PA10
Mcu.Pin35=PJ12
PB15.GPIO_Label=PMOD\#8
Mcu.Pin36=PD2
SH.FMC_D14_DA14.ConfNb=1
Mcu.Pin39=PA9
PG7.GPIO_Label=SAI1_MCLK_A
PI2.Signal=FMC_D26
PF4.GPIO_Label=FMC_A4
Mcu.Pin30=PE3
PA1.GPIO_Label=ETH_REF_CLK
Mcu.Pin33=PG14
Mcu.Pin34=PG13
Mcu.Pin31=PG15
Mcu.Pin32=PK7
PC1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PF13.Signal=FMC_A7
PC10.GPIOParameters=GPIO_Label,PinAttribute
PJ15.GPIO_Label=Audio_INT
SH.FMC_NBL2.0=FMC_NBL2,Sd4ByteEnable1
PC9.GPIOParameters=GPIO_Label,PinAttribute
PF9.GPIOParameters=GPIO_Label,PinAttribute
PI9.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin26=PC12
SH.FMC_D18.0=FMC_D18,sd-32b-d1
Mcu.Pin27=PI3
Mcu.Pin24=PG12
SH.FMC_D21.ConfNb=1
Mcu.Pin25=PD7
CORTEX_M7.IPParameters=CPU_ICache,CPU_DCache,MPU_Control,Enable-Cortex_Memory_Protection_Unit_Region0_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings,Size-Cortex_Memory_Protection_Unit_Region0_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region0_Settings,Enable-Cortex_Memory_Protection_Unit_Region1_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings,Size-Cortex_Memory_Protection_Unit_Region1_Settings,TypeExtField-Cortex_Memory_Protection_Unit_Region1_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings,Enable-Cortex_Memory_Protection_Unit_Region2_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings,Size-Cortex_Memory_Protection_Unit_Region2_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings,IsShareable-Cortex_Memory_Protection_Unit_Region1_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings,IsShareable-Cortex_Memory_Protection_Unit_Region0_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings
Mcu.Pin28=PE5
Mcu.Pin29=PE4
PC8.Mode=SD_4_bits_Wide_bus
ADC3.Rank-1\#ChannelRegularConversion=1
DSI_D0N.Mode=DSIHost_Video
PD14.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin22=PK6
ETH.MediaInterface=HAL_ETH_RMII_MODE
Mcu.Pin23=PK3
PA8.PinAttribute=CortexM7
Mcu.Pin20=PC14-OSC32_IN (OSC32_IN)
ADC1.master=1
Mcu.Pin21=PE0
PA3.Locked=true
PJ0.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PD10.Locked=true
PC14-OSC32_IN\ (OSC32_IN).GPIO_Label=OSC32_IN
PA10.Locked=true
PA5.GPIO_Label=ULPI_CK
PJ3.GPIO_Mode=GPIO_MODE_INPUT
PC12.GPIO_Label=SDIO1_CK
PE5.GPIO_Label=SAI1_SCK_A
PD15.Locked=true
PJ8.Signal=UART8_TX
PJ0.GPIO_Label=ARD_D7
PE9.PinAttribute=CortexM7
SH.FMC_SDNRAS.ConfNb=1
ProjectManager.HeapSize=0x200
Mcu.Pin15=PC11
Mcu.Pin16=PI2
PB1.Mode=Device_HS
Mcu.Pin13=PG11
Mcu.Pin14=PJ15
PH6.Signal=FMC_SDNE1
Mcu.Pin19=PC15-OSC32_OUT (OSC32_OUT)
PF10.GPIOParameters=GPIO_Label,PinAttribute
PD9.PinAttribute=CortexM7
PG12.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin17=PH15
NVIC1.DMA1_Stream0_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.Pin18=PH14
Mcu.Pin11=PB6
Mcu.Pin12=PK4
PD0.GPIOParameters=GPIO_Label,PinAttribute
PF0.GPIO_Label=FMC_A0
PG0.GPIOParameters=GPIO_Label,PinAttribute
PC5.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.Pin10=PE1
PD15.PinAttribute=CortexM7
PI11.GPIO_Label=ULPI_DIR
PE3.Signal=SAI1_SD_B
PC9.PinAttribute=CortexM7
PF4.Signal=FMC_A4
SH.FMC_D26.ConfNb=1
PD2.Signal=SDMMC1_CMD
PC1.PinAttribute=CortexM7
NVIC1.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Dma.DAC1_CH1.0.Direction=DMA_MEMORY_TO_PERIPH
PC1.Mode=RMII
PI1.GPIO_Label=FMC_D25
PG15.Locked=true
Mcu.Family=STM32H7
ProjectManager.MainLocation=Core/Src
PD2.PinAttribute=CortexM7
VP_STMicroelectronics.X-CUBE-ALGOBUILD_M7_VS_DSPOoLibraryJjLibrary_1.2.0_1.2.0.Mode=DSPOoLibraryJjLibrary
LWIP0.BSP.STBoard=false
SH.FMC_A6.ConfNb=1
PK3.Signal=GPIO_Input
SPI2.VirtualNSS=VM_NSSHARD
SH.FMC_A8.0=FMC_A8,13b-sda1
PB10.PinAttribute=CortexM7
PG7.PinAttribute=CortexM7
Dma.DAC1_CH1.0.Priority=DMA_PRIORITY_HIGH
PG9.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin150=PE14
Mcu.Pin151=PH7
ProjectManager.KeepUserCode=true
PH14.Signal=FMC_D22
PH10.Signal=FMC_D18
SH.FMC_D14_DA14.0=FMC_D14,sd-32b-d1
Mcu.Pin156=VP_LTDC_DSIMode
Mcu.Pin157=VP_LWIP_VS_Enabled
PH0-OSC_IN\ (PH0).Signal=RCC_OSC_IN
PG2.Signal=FMC_A12
Mcu.Pin158=VP_RNG_VS_RNG
Mcu.Pin159=VP_RTC_VS_RTC_Activate
PE11.GPIO_Label=FMC_D8
PA1_C.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin152=PB13
Mcu.Pin153=PB14
Mcu.Pin154=PD8
PG2.Locked=true
Mcu.Pin155=VP_DMA2D_VS_DMA2D
PC15-OSC32_OUT\ (OSC32_OUT).Mode=LSE-External-Oscillator
PC5.Locked=true
PF0.GPIOParameters=GPIO_Label,PinAttribute
PA12.GPIOParameters=GPIO_Label,PinAttribute
PA9.GPIOParameters=GPIO_Label,PinAttribute
PA11.GPIOParameters=GPIO_Label,PinAttribute
PD0.GPIO_Label=FMC_D2
PA11.Mode=NSS_Signal_Hard_Input
PH10.Locked=true
RCC.PLL1_VCO_SEL-AdvancedSettings=RCC_PLL1VCOMEDIUM
RCC.PLL2FRACN=0
PD2.Locked=true
SH.FMC_A14_BA0.0=FMC_BA0,TwoSdramBanks1
RCC.VCO2OutputFreq_Value=344000000
DSI_CKP.Mode=DSIHost_Video
SH.FMC_A11.0=FMC_A11,13b-sda1
Mcu.Pin160=VP_SYS_VS_Systick
Mcu.Pin161=VP_SYS_M4_VS_Systick
Mcu.Pin162=VP_TIM6_VS_ClockSourceINT
PC1.Locked=true
PB13.GPIO_Label=ULPI_D6
PC12.PinAttribute=CortexM7
PB15.Signal=GPIO_Input
PF12.GPIOParameters=GPIO_Label,PinAttribute
PE3.PinAttribute=CortexM7
Mcu.Pin163=VP_TIM13_VS_ClockSourceINT
PG15.Signal=FMC_SDNCAS
PG11.Signal=ETH_TX_EN
SH.S_TIM13_CH1.0=TIM13_CH1,Input_Capture1_from_TI1
PH5.GPIOParameters=GPIO_Label,PinAttribute
PJ5.GPIO_Label=ARD_D8
Mcu.Pin164=VP_STMicroelectronics.X-CUBE-ALGOBUILD_M7_VS_DSPOoLibraryJjLibrary_1.2.0_1.2.0
PB5.GPIOParameters=GPIO_Label,PinAttribute
DSI_D0N.PinAttribute=CortexM7
PG15.PinAttribute=CortexM7
Mcu.Pin138=PB12
Mcu.Pin139=PB15
Mcu.IP4=DAC1
Mcu.IP5=DMA
Mcu.IP2=CORTEX_M4
Mcu.IP3=CORTEX_M7
PK4.GPIOParameters=GPIO_Label,PinAttribute
PI11.Mode=Device_HS
Mcu.IP0=ADC1
Mcu.IP1=ADC3
PE4.GPIOParameters=GPIO_Label,PinAttribute
PF9.Locked=true
SAI1.Instance-SAI_B_SPDIF=SAI$Index_Block_B
PH3.Locked=true
PF1.GPIOParameters=GPIO_Label,PinAttribute
RCC.DIVP3Freq_Value=120000000
RCC.SDMMCFreq_Value=192000000
PI9.PinAttribute=CortexM7
Mcu.Pin134=PE8
Dma.DAC1_CH1.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Mcu.Pin135=PE13
Mcu.Pin136=PH6
Mcu.Pin137=PH8
Mcu.Pin130=PC4
Mcu.Pin131=PB1
Mcu.Pin132=PF11
Mcu.Pin133=PG0
Dma.DAC1_CH1.0.EventEnable=DISABLE
ProjectManager.PreviousToolchain=
PF1.Locked=true
PG8.GPIOParameters=GPIO_Label,PinAttribute
PC0.PinAttribute=CortexM7
Mcu.Pin149=PE7
SH.FMC_NBL1.0=FMC_NBL1,Sd4ByteEnable1
PA1_C.Locked=true
PA8.GPIOParameters=GPIO_Label,PinAttribute
PE15.PinAttribute=CortexM7
Mcu.Pin140=PD10
TIM8.IPParameters=Channel-Output Compare2 CH2 CH2N
RCC.HRTIMFreq_Value=240000000
Mcu.Pin145=PB0
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_1
PH1-OSC_OUT\ (PH1).Mode=HSE-External-Oscillator
Mcu.Pin146=PJ3
RCC.DIVR3Freq_Value=120000000
RCC.HSE_VALUE=25000000
Mcu.Pin147=PJ4
Mcu.Pin148=PG1
PA0_C.PinAttribute=CortexM7
Mcu.Pin141=PD9
SH.FMC_A14_BA0.ConfNb=1
Mcu.Pin142=PA3
Mcu.Pin143=PA4
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_SIZE_32MB
Mcu.Pin144=PC5
Mcu.IP10=HDMI_CEC
Mcu.IP12=LWIP
Mcu.IP11=LTDC
PB12.PinAttribute=CortexM7
PG11.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.IP18=RTC
PC4.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
Mcu.IP17=RNG
Mcu.IP19=SAI1
Mcu.IP14=NVIC2
NVIC2.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.DIVP1Freq_Value=480000000
PF9.Mode=Dual_Bank
Mcu.IP13=NVIC1
Mcu.IP16=RCC
Mcu.IP15=QUADSPI
PI4.Locked=true
PH7.GPIO_Label=FMC_SDCKE1
PE8.Locked=true
PJ7.GPIO_Label=ARD_D6
PF11.Signal=FMC_SDNRAS
PC11.GPIO_Label=SDIO1_D3
PB5.Mode=Device_HS
PD14.PinAttribute=CortexM7
PE3.GPIOParameters=GPIO_Label,PinAttribute
PJ12.GPIO_Label=BL_CTRL
PK3.GPIOParameters=GPIO_Label,PinAttribute
PE3.Locked=true
Mcu.IP21=SPDIFRX1
PH6.GPIOParameters=GPIO_Label,PinAttribute
Mcu.IP20=SDMMC1
Mcu.IP23=SPI5
NVIC1.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP22=SPI2
Mcu.IP29=UART8
PF11.GPIOParameters=GPIO_Label,PinAttribute
Mcu.IP28=TIM13
CortexM7.IPs=BDMA\:I,DMA\:I,FATFS_M7\:I,FREERTOS_M7\:I,IWDG1\:I,MDMA\:I,NVIC1\:I,RCC\:I,USB_DEVICE_M7\:I,USB_HOST_M7\:I,WWDG1\:I,USART1\:I,CORTEX_M7\:I,DEBUG\:I,PDM2PCM_M7\:I,PWR\:I,RESMGR_UTILITY\:I,SYS\:I,OPENAMP_M7\:I,VREFBUF\:I,ADC1\:I,ADC3\:I,RTC\:I,TIM8\:I,TIM13\:I,ETH\:I,FMC\:I,QUADSPI\:I,SDMMC1\:I,SPI2\:I,SPI5\:I,UART8\:I,HDMI_CEC\:I,SAI1\:I,SPDIFRX1\:I,USB_OTG_HS\:I,DSIHOST\:I,LTDC\:I,DMA2D\:I,LWIP\:I,STMicroelectronics.X-CUBE-ALGOBUILD.1.2.0_M7\:I,RNG\:I,DAC1\:I,TIM6\:I
LWIP0.BSP.solution=LAN8742
PD10.PinAttribute=CortexM7
Mcu.IP25=SYS_M4
SH.FMC_D27.ConfNb=1
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
Mcu.IP24=SYS
PB6.GPIOParameters=GPIO_Label,PinAttribute
PF8.PinAttribute=CortexM7
Mcu.IP27=TIM8
Mcu.IP26=TIM6
PB0.Locked=true
SH.FMC_D16.ConfNb=1
LWIP0.BSP.i2creg=
PJ13.Locked=true
PB12.Mode=Device_HS
PC10.PinAttribute=CortexM7
Mcu.IP31=USB_OTG_HS
PG11.Locked=true
RCC.EnbaleCSS=false
Mcu.IP30=USART1
SH.FMC_D4_DA4.ConfNb=1
ProjectManager.ToolChainLocation=
RCC.DSIFreq_Value=31250000
PF8.Signal=S_TIM13_CH1
PG0.GPIO_Label=FMC_A10
SH.FMC_D30.ConfNb=1
RCC.DIVR1Freq_Value=480000000
PF4.PinAttribute=CortexM7
PI0.GPIO_Label=FMC_D24
STMicroelectronics.X-CUBE-ALGOBUILD.1.2.0_M7.DSPOoLibraryJjLibrary_Checked=true
Mcu.Pin95=PJ0
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_SIZE_16KB
Mcu.Pin96=PE10
PF4.Locked=true
Mcu.Pin93=PA2
Mcu.Pin94=PA1
Mcu.Pin99=PJ6
PB5.GPIO_Label=ULPI_D7
Mcu.Pin97=PJ8
Mcu.Pin98=PJ7
PC3.PinAttribute=CortexM7
Mcu.Pin91=DSI_D0N
PE12.PinAttribute=CortexM7
Mcu.Pin92=PH2
PG11.GPIO_Label=ETH_TX_EN
PH8.PinAttribute=CortexM7
Mcu.Pin90=DSI_D0P
PC5.Signal=ETH_RXD1
PH2.Mode=Dual_Bank
PE7.Signal=FMC_D4_DA4
DSI_D1P.Mode=DSIHost_Video
Dma.Request0=DAC1_CH1
PF3.GPIO_Label=FMC_A3
SH.FMC_D22.ConfNb=1
CORTEX_M7.IsShareable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_ACCESS_NOT_SHAREABLE
PF15.GPIOParameters=GPIO_Label,PinAttribute
PE12.Locked=true
Dma.DAC1_CH1.0.PeriphInc=DMA_PINC_DISABLE
Mcu.Pin84=DSI_CKP
Mcu.Pin85=DSI_CKN
Mcu.Pin82=PF9
PB15.Locked=true
PG2.GPIO_Label=FMC_A12
Mcu.Pin83=PJ10
PH1-OSC_OUT\ (PH1).PinAttribute=CortexM7
Mcu.Pin88=PC3
PA3.Signal=USB_OTG_HS_ULPI_D0
Mcu.Pin89=PJ9
PF15.PinAttribute=CortexM7
PH1-OSC_OUT\ (PH1).GPIO_Label=OSC_OUT
Mcu.Pin86=PC1
Mcu.Pin87=PC2
SH.FMC_A3.ConfNb=1
PK1.Mode=NSS_Signal_Hard_Input
