Ondulab/CISYNTH_MOD-747DISCO/SSS_MOD-747DISCO.ioc
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
PB14.PinAttribute=Free
PK6.Signal=GPIO_Input
PK6.Locked=true
PK4.Locked=true
SH.FMC_D20.0=FMC_D20,sd-32b-d1
PJ3.GPIO_PuPd=GPIO_PULLUP
PH8.GPIOParameters=GPIO_Label,PinAttribute
PH15.Locked=true
PG7.Locked=true
PD15.GPIO_Label=FMC_D1
PG7.Signal=SAI1_MCLK_A
PE14.GPIOParameters=GPIO_Label,PinAttribute
PA10.Mode=Asynchronous
PJ8.Mode=Asynchronous
PA0_C.Signal=ADCx_INP0
PH13.PinAttribute=CortexM7
PH12.GPIO_Label=FMC_D20
PC9.GPIO_Label=SDIO1_D1
PE10.PinAttribute=CortexM7
PC11.Signal=SDMMC1_D3
RCC.DSITX_Div=2
PI14.Signal=GPIO_Output
PI15.PinAttribute=Free
PC8.Signal=SDMMC1_D0
PC10.Mode=SD_4_bits_Wide_bus
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
SH.FMC_D31.0=FMC_D31,sd-32b-d1
ProjectManager.DefaultFWLocation=true
PC2.Mode=Full_Duplex_Master
PE14.GPIO_Label=FMC_D11
PD9.Signal=FMC_D14_DA14
STMicroelectronics.X-CUBE-ALGOBUILD.1.2.0_M7.IPParameters=LibraryCcDSPOoLibraryJjDSPOoLibrary
PE7.PinAttribute=CortexM7
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
boardIOC=true
SPI5.Mode=SPI_MODE_MASTER
PA12.GPIO_Label=SPI2_SCK
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings=SDRAM_DEVICE_ADDR
PinOutPanel.CurrentBGAView=Top
PJ8.PinAttribute=CortexM7
RCC.FamilyName=M
PH1-OSC_OUT\ (PH1).Signal=RCC_OSC_OUT
SH.ADCx_INP1.0=ADC1_INP1,IN1-Single-Ended
PE15.GPIOParameters=GPIO_Label,PinAttribute
PD8.GPIO_Label=FMC_D13
DSI_D0P.PinAttribute=CortexM7
PI7.PinAttribute=CortexM7
PG8.GPIO_Label=FMC_SDCLK
USART1.VirtualMode-Asynchronous=VM_ASYNC
RCC.PLL3_VCO_SEL=RCC_PLL3VCOWIDE
CORTEX_M7.MPU_Control=MPU_PRIVILEGED_DEFAULT
SAI1.RealAudioFreq-SAI_A_MasterWithClock=47.991 KHz
PI5.PinAttribute=CortexM7
PA9.Mode=Asynchronous
PJ5.Locked=true
PK2.GPIOParameters=GPIO_Label,PinAttribute
PH1-OSC_OUT\ (PH1).GPIOParameters=GPIO_Label,PinAttribute
PF10.PinAttribute=CortexM7
PH7.GPIOParameters=GPIO_Label,PinAttribute
NVIC1.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF6.Signal=QUADSPI_BK1_IO3
PC15-OSC32_OUT\ (OSC32_OUT).Signal=RCC_OSC32_OUT
PH8.Locked=true
PB10.GPIO_Label=ULPI_D3
RCC.VCO1OutputFreq_Value=960000000
SH.S_TIM13_CH1.ConfNb=1
PC3_C.Locked=true
PI13.PinAttribute=Free
PF6.Locked=true
SH.FMC_D13_DA13.0=FMC_D13,sd-32b-d1
PH8.Signal=FMC_D16
VP_RNG_VS_RNG.Signal=RNG_VS_RNG
NVIC2.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PC5.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
RCC.AXIClockFreq_Value=240000000
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
LWIP0.BSP.instance=LAN8742
PK0.GPIOParameters=GPIO_Label,PinAttribute
PE0.Locked=true
RCC.USBFreq_Value=48000000
PI5.GPIOParameters=GPIO_Label,PinAttribute
PF9.GPIO_Label=QSPI_BK1_IO1
SH.FMC_D24.ConfNb=1
PD10.GPIO_Label=FMC_D15
PA1.Signal=ETH_REF_CLK
RCC.CKPERFreq_Value=64000000
LWIP0.BSP.semaphore=
ProjectManager.BootMode=boot0
PD2.Mode=SD_4_bits_Wide_bus
PK0.PinAttribute=CortexM7
PH9.GPIOParameters=GPIO_Label,PinAttribute
PH1-OSC_OUT\ (PH1).Locked=true
SPI5.VirtualNSS=VM_NSSHARD
PJ0.GPIO_PuPd=GPIO_PULLUP
board=STM32H747I-DISCO
PG12.Mode=RMII
PF14.GPIOParameters=GPIO_Label,PinAttribute
PI9.Signal=FMC_D30
PH4.GPIO_Label=ULPI_NXT
PI9.Locked=true
SH.FMC_D22.0=FMC_D22,sd-32b-d1
PI13.GPIO_Label=LED2
NVIC1.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
MxCube.Version=6.2.1
PK7.PinAttribute=Free
PH15.PinAttribute=CortexM7
RCC.FDCANFreq_Value=192000000
PJ4.GPIOParameters=GPIO_Label,PinAttribute
RCC.PLLDSINDIV=10
PI4.Signal=FMC_NBL2
PA1.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PE5.Mode=SAI_A_MasterWithClock
RCC.ADCFreq_Value=64000000
PA10.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIO_Label=ETH_MDC/SAI4_D1
VP_SYS_VS_Systick.Mode=SysTick
SH.FMC_D12_DA12.0=FMC_D12,sd-32b-d1
PF15.GPIO_Label=FMC_A9
SH.FMC_D29.ConfNb=1
PF14.Locked=true
PE5.Locked=true
SH.FMC_D18.ConfNb=1
PF1.Signal=FMC_A1
Dma.DAC1_CH1.0.MemInc=DMA_MINC_ENABLE
SH.FMC_D11_DA11.ConfNb=1
PA0_C.GPIOParameters=GPIO_Label,PinAttribute
PC13.Mode=Tamper 1 enabled - Input Enabled to TAMP1
PJ13.PinAttribute=Free
RCC.IPParameters=ADCCLockSelection,ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CPU2Freq_Value,CPU2SystikFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2,DIVP2Freq_Value,DIVP3,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,DSIFreq_Value,DSITXEscFreq_Value,DSITX_Div,EnbaleCSS,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HRTIMFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL1_VCI_Range-AdvancedSettings,PLL1_VCO_SEL-AdvancedSettings,PLL2FRACN,PLL2_VCI_Range-AdvancedSettings,PLL2_VCO_SEL-AdvancedSettings,PLL3FRACN,PLL3_VCI_Range,PLL3_VCI_Range-AdvancedSettings,PLL3_VCO_SEL,PLLDSIFreq_Value,PLLDSINDIV,PLLDSIVCOFreq_Value,PLLFRACN,PLLSourceVirtual,PWR_Regulator_Voltage_Scale,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1CLockSelection,SAI1Freq_Value,SAI23Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,SupplySource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
PJ0.Signal=GPIO_Input
ProjectManager.AskForMigrate=true
PE0.Signal=FMC_NBL0
PE7.GPIO_Label=FMC_D4
PE12.Signal=FMC_D9_DA9
DSI_CKP.PinAttribute=CortexM7
PB2.Locked=true
Mcu.IP8=ETH
Mcu.IP9=FMC
PJ6.PinAttribute=CortexM7
Mcu.IP6=DMA2D
Mcu.IP7=DSIHOST
ProjectManager.CoupleFile=true
RCC.SYSCLKFreq_VALUE=480000000
RCC.I2C123Freq_Value=120000000
Mcu.ThirdParty0_Instance=STMicroelectronics.X-CUBE-ALGOBUILD.1.2.0_M7
PE5.PinAttribute=CortexM7
PA1.Locked=true
KeepUserPlacement=false
PC15-OSC32_OUT\ (OSC32_OUT).GPIO_Label=OSC32_OUT
PB2.Mode=Dual_Bank
PJ5.Signal=GPIO_Input
DSI_D0P.Signal=DSIHOST_D0P
PB2.GPIO_Label=QSPI_CLK
PF13.GPIOParameters=GPIO_Label,PinAttribute
PD11.Mode=Dual_Bank
PF6.PinAttribute=CortexM7
PI6.GPIOParameters=GPIO_Label,PinAttribute
NVIC2.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PI3.GPIO_Label=FMC_D27
PH0-OSC_IN\ (PH0).GPIO_Label=OSC_IN
PH3.Signal=QUADSPI_BK2_IO1
PC3_C.Signal=ADC3_INP1
PA2.Mode=RMII
PC5.PinAttribute=CortexM7
STMicroelectronics.X-CUBE-ALGOBUILD.1.2.0_M7.LibraryCcDSPOoLibraryJjDSPOoLibrary=true
Dma.DAC1_CH1.0.SyncRequestNumber=1
PC8.Locked=true
PI14.Locked=true
CORTEX_M7.CPU_DCache=Enabled
LWIP0.BSP.name=Driver_PHY
Dma.DAC1_CH1.0.SyncSignalID=NONE
SH.FMC_D8_DA8.ConfNb=1
PD9.Locked=true
PH6.PinAttribute=CortexM7
ADC3.NbrOfConversionFlag=1
SH.S_TIM8_CH2.ConfNb=1
PB12.Signal=USB_OTG_HS_ULPI_D5
PG11.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PE1.GPIOParameters=GPIO_Label,PinAttribute
PJ13.Signal=GPIO_Input
PK1.GPIO_Label=ARD_D10
PA3.GPIO_Label=ULPI_D0
PK1.GPIOParameters=GPIO_Label,PinAttribute
PH0-OSC_IN\ (PH0).GPIOParameters=GPIO_Label,PinAttribute
Dma.DAC1_CH1.0.RequestNumber=1
CortexM4.IPs=BDMA,DMA,FATFS_M4\:I,FREERTOS_M4\:I,IWDG2\:I,MDMA,NVIC2\:I,RCC,USB_DEVICE_M4\:I,USB_HOST_M4\:I,WWDG2\:I,USART1,DCMI\:I,TIM3\:I,DEBUG,PDM2PCM_M4\:I,PWR,RESMGR_UTILITY,SYS_M4\:I,CORTEX_M4\:I,OPENAMP_M4\:I,VREFBUF
PI2.PinAttribute=CortexM7
SH.FMC_D7_DA7.0=FMC_D7,sd-32b-d1
PK5.Locked=true
PK5.Signal=GPIO_Input
SH.FMC_D24.0=FMC_D24,sd-32b-d1
SH.FMC_A4.ConfNb=1
PJ9.Mode=Asynchronous
PH12.Signal=FMC_D20
PH12.Locked=true
SPI2.VirtualType=VM_MASTER
PK5.PinAttribute=Free
PB10.Mode=Device_HS
PC12.Locked=true
PK0.Mode=Full_Duplex_Master
RCC.PLL2_VCI_Range-AdvancedSettings=RCC_PLL2VCIRANGE_0
PG4.Signal=FMC_A14_BA0
PG4.Locked=true
PC12.Signal=SDMMC1_CK
PB14.GPIO_Label=PMOD\#9
PG6.GPIO_Label=QSPI_BK1_NCS
PH6.GPIO_Label=FMC_SDNE1
PG3.GPIOParameters=GPIO_Label,PinAttribute
PK6.GPIO_Label=JOY_UP
PJ4.PinAttribute=Free
PJ3.PinAttribute=CortexM7
PJ3.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute,GPIO_Mode
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
RCC.CPU2Freq_Value=240000000
PC3.Locked=true
PI11.Locked=true
PA3.GPIOParameters=GPIO_Label,PinAttribute
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_FULL_ACCESS
PJ11.PinAttribute=CortexM7
PI6.GPIO_Label=FMC_D28
PB6.GPIO_Label=HDMI_CEC
PJ6.GPIO_Label=ARD_D9
PJ12.PinAttribute=Free
PC5.Mode=RMII
PB13.Signal=USB_OTG_HS_ULPI_D6
PG13.Signal=ETH_TXD0
PG6.Mode=Enable Chip Select 1 for both banks
PinOutPanel.RotationAngle=0
PE6.GPIO_Label=SAI1_SD_A
PF6.GPIO_Label=QSPI_BK1_IO3
DSI_CKN.PinAttribute=CortexM7
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
PJ10.Signal=SPI5_MOSI
RCC.AHB4Freq_Value=240000000
PI3.PinAttribute=CortexM7
PJ10.Locked=true
PI1.PinAttribute=CortexM7
LWIP.NETMASK_ADDRESS=255.255.255.000
NVIC1.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PH10.PinAttribute=CortexM7
SH.FMC_A12.ConfNb=1
NVIC2.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PJ13.GPIO_Label=PMOD\#12
PK6.PinAttribute=Free
PH5.Signal=FMC_SDNWE
DSI_CKN.Signal=DSIHOST_CKN
PK4.PinAttribute=Free
PD15.GPIOParameters=GPIO_Label,PinAttribute
LWIP.IPParameters=LWIP_PERF,LWIP_DHCP,IP_ADDRESS,NETMASK_ADDRESS,GATEWAY_ADDRESS
SH.FMC_D10_DA10.ConfNb=1
PB6.Mode=CEC_Activate
RCC.DIVQ3Freq_Value=120000000
PC3.Signal=SPI2_MOSI
SH.FMC_D17.ConfNb=1
PE5.Signal=SAI1_SCK_A
PE10.Locked=true
PF10.GPIO_Label=ARD_A1
PB13.Locked=true
PH10.GPIO_Label=FMC_D18
NVIC2.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PG13.Locked=true
NVIC2.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PJ0.ContextOwner=CortexM7
PB2.Signal=QUADSPI_CLK
RCC.DIVM3=5
RCC.DIVM2=25
PI4.PinAttribute=CortexM7
PD1.GPIOParameters=GPIO_Label,PinAttribute
RCC.DIVM1=5
DSI_D1P.Signal=DSIHOST_D1P
PG1.GPIOParameters=GPIO_Label,PinAttribute
MxDb.Version=DB.6.0.21
PE15.Locked=true
PB0.GPIOParameters=GPIO_Label,PinAttribute
PE0.GPIOParameters=GPIO_Label,PinAttribute
Dma.DAC1_CH1.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PA1.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
SH.FMC_D26.0=FMC_D26,sd-32b-d1
PJ1.GPIOParameters=GPIO_Label,PinAttribute
PI6.Signal=FMC_D28
PI3.Signal=FMC_D27
SH.FMC_D15_DA15.ConfNb=1
SPI2.CalculateBaudRate=96.0 MBits/s
ADC3.IPParameters=Rank-1\#ChannelRegularConversion,Channel-1\#ChannelRegularConversion,SamplingTime-1\#ChannelRegularConversion,OffsetNumber-1\#ChannelRegularConversion,NbrOfConversionFlag
PJ1.PinAttribute=Free
PJ10.PinAttribute=CortexM7
PF3.Signal=FMC_A3
SH.FMC_D25.ConfNb=1
PJ5.PinAttribute=Free
RCC.DIVR2Freq_Value=172000000
PE10.Signal=FMC_D7_DA7
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
RCC.MCO2PinFreq_Value=480000000
PC8.GPIOParameters=GPIO_Label,PinAttribute
PH10.GPIOParameters=GPIO_Label,PinAttribute
PF8.GPIOParameters=GPIO_Label,PinAttribute
PI0.PinAttribute=CortexM7
PI8.GPIOParameters=GPIO_Label,PinAttribute
PD11.Locked=true
PG13.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PJ5.GPIOParameters=GPIO_Label,PinAttribute
PE10.GPIOParameters=GPIO_Label,PinAttribute
PJ4.Signal=GPIO_Input
RCC.DFSDMFreq_Value=120000000
SAI1.VirtualMode-SAI_B_SPDIF=VM_SPDIF
PA5.GPIOParameters=GPIO_Label,PinAttribute
PB14.GPIOParameters=GPIO_Label,PinAttribute
PF0.PinAttribute=CortexM7
SH.FMC_A1.0=FMC_A1,13b-sda1
PH2.Signal=QUADSPI_BK2_IO0
SH.FMC_SDCLK.0=FMC_SDCLK,13b-sda1
RCC.TraceFreq_Value=64000000
RCC.APB4Freq_Value=120000000
RCC.CECFreq_Value=32000
RCC.SAI23Freq_Value=192000000
PF14.Signal=FMC_A8
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
PI4.GPIOParameters=GPIO_Label,PinAttribute
VP_DMA2D_VS_DMA2D.Mode=DMA2D_Activate
PH4.PinAttribute=CortexM7
PJ13.GPIOParameters=GPIO_Label,PinAttribute
PB10.GPIOParameters=GPIO_Label,PinAttribute
PI11.Signal=USB_OTG_HS_ULPI_DIR
PE10.GPIO_Label=FMC_D7
PH0-OSC_IN\ (PH0).Mode=HSE-External-Oscillator
SH.FMC_D3_DA3.0=FMC_D3,sd-32b-d1
VP_STMicroelectronics.X-CUBE-ALGOBUILD_M7_VS_DSPOoLibraryJjLibrary_1.2.0_1.2.0.Signal=STMicroelectronics.X-CUBE-ALGOBUILD_M7_VS_DSPOoLibraryJjLibrary_1.2.0_1.2.0
SPI5.VirtualType=VM_MASTER
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
RCC.SupplySource=PWR_DIRECT_SMPS_SUPPLY
PG0.PinAttribute=CortexM7
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ACCESS_BUFFERABLE
PF4.GPIOParameters=GPIO_Label,PinAttribute
PC4.Mode=RMII
LWIP.IP_ADDRESS=192.168.000.001
PI10.GPIO_Label=FMC_D31
PH12.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_A7.ConfNb=1
PH15.Signal=FMC_D23
PK1.PinAttribute=CortexM7
SH.FMC_A1.ConfNb=1
RCC.DIVQ3=8
TIM8.Channel-Output\ Compare2\ CH2\ CH2N=TIM_CHANNEL_2
PJ15.GPIOParameters=GPIO_Label,PinAttribute
RCC.DIVQ1=5
ADC1.Rank-0\#ChannelRegularConversion=1
SH.FMC_D28.0=FMC_D28,sd-32b-d1
DAC1.DAC_Channel-DAC_OUT1=DAC_CHANNEL_1
PD9.GPIO_Label=FMC_D14
PF1.PinAttribute=CortexM7
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master
STMicroelectronics.X-CUBE-ALGOBUILD.1.2.0_M7_SwParameter=LibraryCcDSPOoLibraryJjDSPOoLibrary\:true;
PG9.Locked=true
PG9.Signal=QUADSPI_BK2_IO2
PA9.GPIO_Label=STLINK_RX
NVIC1.CEC_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.SWPMI1Freq_Value=120000000
RCC.DIVP3=8
DSI_D0N.GPIOParameters=PinAttribute
PB11.GPIO_Label=ULPI_D4
PE0.PinAttribute=CortexM7
PD7.Signal=SPDIFRX1_IN0
PD1.Signal=FMC_D3_DA3
PA11.GPIO_Label=PMOD\#1
RCC.DIVP2=7
PF14.GPIO_Label=FMC_A8
LWIP.LWIP_DHCP=0
PC0.Signal=USB_OTG_HS_ULPI_STP
PK2.Locked=true
PC11.GPIOParameters=GPIO_Label,PinAttribute
RCC.QSPIFreq_Value=240000000
PF13.GPIO_Label=FMC_A7
PG13.GPIO_Label=ETH_TXD0
PJ15.PinAttribute=Free
SH.S_TIM8_CH2.0=TIM8_CH2,Output Compare2 CH2 CH2N
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
SH.FMC_A3.0=FMC_A3,13b-sda1
RCC.USART234578Freq_Value=120000000
PJ7.Signal=TIM8_CH2N
PA11.Locked=true
PK2.PinAttribute=Free
PH12.PinAttribute=CortexM7
PA12.PinAttribute=CortexM7
SH.FMC_D31.ConfNb=1
RCC.SPI123Freq_Value=192000000
PB11.Mode=Device_HS
TIM13.Channel=TIM_CHANNEL_1
SH.FMC_D15_DA15.0=FMC_D15,sd-32b-d1
PC3_C.GPIOParameters=GPIO_Label,PinAttribute
NVIC2.ForceEnableDMAVector=true
PA9.Signal=USART1_TX
RCC.DIVN3=192
RCC.DIVN2=344
RCC.DIVN1=192
PH3.PinAttribute=CortexM7
PB5.Locked=true
PC2_C.Mode=IN0-Single-Ended
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region0_Settings=0x30040000
PI1.Locked=true
PD7.Locked=true
PE9.GPIO_Label=FMC_D6
SH.FMC_D17.0=FMC_D17,sd-32b-d1
PF12.PinAttribute=CortexM7
PB10.Signal=USB_OTG_HS_ULPI_D3
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
PG3.PinAttribute=Free
PJ15.Signal=GPIO_Input
PH9.GPIO_Label=FMC_D17
PG1.PinAttribute=CortexM7
Dma.DAC1_CH1.0.MemDataAlignment=DMA_MDATAALIGN_WORD
PI9.GPIO_Label=FMC_D30
PH6.Mode=SdramChipSelect2_1
ProjectManager.LastFirmware=true
PJ3.ContextOwner=CortexM7
Mcu.Pin116=PC3_C
PA7.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PI2.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin117=PA7
PF2.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin118=PB2
Mcu.Pin119=PF12
VP_TIM13_VS_ClockSourceINT.Mode=Enable_Timer
PI6.Locked=true
PK3.PinAttribute=Free
PA1.Mode=RMII
SH.FMC_D20.ConfNb=1
Mcu.ThirdParty0_ContextShortName=M7
VP_DMA2D_VS_DMA2D.Signal=DMA2D_VS_DMA2D
PH11.PinAttribute=CortexM7
PE15.Signal=FMC_D12_DA12
PA11.PinAttribute=CortexM7
PE8.Signal=FMC_D5_DA5
PI1.Signal=FMC_D25
RCC.RNGFreq_Value=48000000
PC2.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin112=PH11
Mcu.Pin113=PD15
PH2.PinAttribute=CortexM7
Mcu.Pin114=PD14
Mcu.Pin115=PC2_C
PF12.Locked=true
PF11.Locked=true
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_FULL_ACCESS
Mcu.Pin110=PB11
Mcu.Pin111=PH10
PA9.Locked=true
Mcu.Pin127=PA0_C
Mcu.Pin128=PA1_C
SH.ADCx_INP0.ConfNb=1
Mcu.Pin129=PA5
PE1.PinAttribute=CortexM7
PI0.Locked=true
PE7.Locked=true
SH.FMC_SDNCAS.0=FMC_SDNCAS,13b-sda1
PG14.GPIO_Label=QSPI_BK2_IO3
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=120000000
SH.FMC_NBL1.ConfNb=1
PJ1.Locked=true
ADC3.Channel-1\#ChannelRegularConversion=ADC_CHANNEL_0
PH4.Mode=Device_HS
ProjectManager.UnderRoot=true
PE13.Locked=true
PH14.GPIO_Label=FMC_D22
SH.FMC_D7_DA7.ConfNb=1
Mcu.Pin123=PJ5
PJ15.Locked=true
Mcu.Pin124=PH9
Mcu.Pin125=PH12
PA4.Signal=COMP_DAC11_group
Mcu.Pin126=PD11
VP_SYS_M4_VS_Systick.Signal=SYS_M4_VS_Systick
PB5.Signal=USB_OTG_HS_ULPI_D7
PG15.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin120=PF15
Mcu.Pin121=PE12
Mcu.Pin122=PE15
PE13.GPIO_Label=FMC_D10
SAI1.RealAudioFreq-SAI_B_SPDIF=767.857 KHz
PC3_C.PinAttribute=CortexM7
PD11.Signal=QUADSPI_BK1_IO0
SH.FMC_A10.ConfNb=1
ProjectManager.CompilerOptimize=6
PG11.Mode=RMII
SH.FMC_A5.0=FMC_A5,13b-sda1
PA11.Signal=SPI2_NSS
PD1.PinAttribute=CortexM7
PJ7.Locked=true
PK3.GPIO_Label=JOY_DOWN
PH5.Locked=true
LWIP.Version=v2.1.2_Cube
PF2.PinAttribute=CortexM7
PF8.Locked=true
PF6.Mode=Dual_Bank
RCC.LPTIM345Freq_Value=120000000
ProjectManager.ComputerToolchain=false
PF9.Signal=QUADSPI_BK1_IO1
PJ10.Mode=Full_Duplex_Master
RCC.LTDCFreq_Value=120000000
Mcu.Pin109=PB10
PC3.GPIO_Label=PMOD\#2
PF3.Locked=true
PJ7.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin105=PF13
PA8.Mode=Clock-out-1
Mcu.Pin106=PF14
Mcu.Pin107=PE9
Mcu.Pin108=PE11
PE12.GPIOParameters=GPIO_Label,PinAttribute
PE14.PinAttribute=CortexM7
SH.FMC_NBL3.0=FMC_NBL3,Sd4ByteEnable1
PG3.GPIO_Label=DSI_Reset
SH.FMC_D12_DA12.ConfNb=1
RCC.HCLK3ClockFreq_Value=240000000
RCC.DIVR3=8
PD1.Locked=true
