Ondulab/CISYNTH_MOD-747DISCO/SSS_MOD-747DISCO.ioc
SPI5.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS,BaudRatePrescaler
PA1_C.PinAttribute=CortexM7
PB0.Signal=USB_OTG_HS_ULPI_D1
Mcu.ContextNb=2
SH.FMC_D19.0=FMC_D19,sd-32b-d1
PA7.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
RCC.CPU2SystikFreq_Value=240000000
PC0.Locked=true
PC1.Signal=ETH_MDC
PF13.PinAttribute=CortexM7
PB12.GPIOParameters=GPIO_Label,PinAttribute
PD7.GPIOParameters=GPIO_Label,PinAttribute
PD2.GPIO_Label=SDIO1_CMD
PG7.GPIOParameters=GPIO_Label,PinAttribute
PH2.GPIO_Label=QSPI_BK2_IO0
Dma.DAC1_CH1.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Mcu.Pin101=PH4
Mcu.Pin102=PH5
Mcu.Pin103=PI15
Mcu.Pin104=PJ1
PG2.PinAttribute=CortexM7
Mcu.Pin100=PH3
PC3.Mode=Full_Duplex_Master
RCC.DIVQ2Freq_Value=172000000
PK7.Signal=GPIO_Input
PK7.Locked=true
RCC.SAI1Freq_Value=49142857.14285714
RCC.CortexFreq_Value=480000000
SH.FMC_A2.ConfNb=1
CORTEX_M7.IPParametersWithoutCheck=BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings
PG6.Signal=QUADSPI_BK1_NCS
PH14.Locked=true
PI10.GPIOParameters=GPIO_Label,PinAttribute
Mcu.UserName=STM32H747XIHx
Dma.DAC1_CH1.0.FIFOMode=DMA_FIFOMODE_DISABLE
PF5.PinAttribute=CortexM7
PD9.GPIOParameters=GPIO_Label,PinAttribute
RCC.HPRE=RCC_HCLK_DIV2
PJ9.GPIOParameters=GPIO_Label,PinAttribute
PH0-OSC_IN\ (PH0).Locked=true
PC10.Locked=true
PG6.Locked=true
PC10.Signal=SDMMC1_D2
PA1_C.Signal=ADCx_INP1
SH.FMC_NBL0.0=FMC_NBL0,Sd4ByteEnable1
PI13.Locked=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true-CortexM7,2-MX_DMA_Init-DMA-false-HAL-true-CortexM7,3-SystemClock_Config-RCC-false-HAL-false-CortexM7,false-4-MX_USART1_UART_Init-USART1-true-HAL-true-CortexM7,false-5-MX_ADC1_Init-ADC1-true-HAL-true-CortexM7,false-6-MX_ADC3_Init-ADC3-true-HAL-true-CortexM7,false-7-MX_FMC_Init-FMC-true-HAL-true-CortexM7,false-8-MX_HDMI_CEC_Init-HDMI_CEC-true-HAL-true-CortexM7,false-9-MX_QUADSPI_Init-QUADSPI-true-HAL-true-CortexM7,false-10-MX_RTC_Init-RTC-true-HAL-true-CortexM7,false-11-MX_SAI1_Init-SAI1-true-HAL-true-CortexM7,false-12-MX_SDMMC1_SD_Init-SDMMC1-true-HAL-true-CortexM7,false-13-MX_SPDIFRX1_Init-SPDIFRX1-true-HAL-true-CortexM7,false-14-MX_SPI2_Init-SPI2-true-HAL-true-CortexM7,false-15-MX_SPI5_Init-SPI5-true-HAL-true-CortexM7,false-16-MX_TIM8_Init-TIM8-true-HAL-true-CortexM7,false-17-MX_TIM13_Init-TIM13-true-HAL-true-CortexM7,false-18-MX_UART8_Init-UART8-true-HAL-true-CortexM7,false-19-MX_USB_OTG_HS_PCD_Init-USB_OTG_HS-true-HAL-true-CortexM7,false-20-MX_DSIHOST_DSI_Init-DSIHOST-true-HAL-true-CortexM7,false-21-MX_LTDC_Init-LTDC-true-HAL-true-CortexM7,false-22-MX_DMA2D_Init-DMA2D-true-HAL-true-CortexM7,23-MX_LWIP_Init-LWIP-true-HAL-false-CortexM7,24-MX_RNG_Init-RNG-false-HAL-true-CortexM7,25-MX_DAC1_Init-DAC1-false-HAL-true-CortexM7,26-MX_TIM6_Init-TIM6-false-HAL-true-CortexM7,1-MX_DMA_Init-DMA-false-HAL-true-CortexM4,2-MX_USART1_UART_Init-USART1-true-HAL-false-CortexM4,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true-CortexM7,0-MX_CORTEX_M4_Init-CORTEX_M4-false-HAL-true-CortexM4
PC0.GPIOParameters=GPIO_Label,PinAttribute
PA2.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PC0.GPIO_Label=ULPI_STP
SH.FMC_D6_DA6.0=FMC_D6,sd-32b-d1
DSI_D1N.PinAttribute=CortexM7
PB0.GPIO_Label=ULPI_D1
PI5.GPIO_Label=FMC_NBL3
PH5.GPIO_Label=FMC_SDNWE
PC13.GPIO_Label=B2 [Wakeup Button]
PK5.GPIO_Label=JOY_RIGHT
PB11.Signal=USB_OTG_HS_ULPI_D4
PI0.GPIOParameters=GPIO_Label,PinAttribute
PK5.GPIOParameters=GPIO_Label,PinAttribute
PC11.PinAttribute=CortexM7
PI14.GPIO_Label=LED3
PE4.PinAttribute=CortexM7
PE5.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.StackSize=0x400
PI11.GPIOParameters=GPIO_Label,PinAttribute
RCC.VCOInput3Freq_Value=5000000
PH3.Mode=Dual_Bank
PJ6.Locked=true
PJ6.Signal=S_TIM8_CH2
PB11.PinAttribute=CortexM7
PA12.Locked=true
SH.FMC_A7.0=FMC_A7,13b-sda1
PA12.Signal=SPI2_SCK
PH4.GPIOParameters=GPIO_Label,PinAttribute
Mcu.UserConstants=
PH7.Locked=true
PI1.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PF5.Locked=true
Mcu.ThirdPartyNb=1
DSI_D0P.GPIOParameters=PinAttribute
PA10.PinAttribute=CortexM7
PD11.GPIO_Label=QSPI_BK1_IO0
RCC.HCLKFreq_Value=240000000
Mcu.IPNb=32
PH7.PinAttribute=CortexM7
RCC.SPDIFRXFreq_Value=192000000
PF11.GPIO_Label=FMC_SDRAS
PH9.PinAttribute=CortexM7
PF12.Signal=FMC_A6
PD8.GPIOParameters=GPIO_Label,PinAttribute
PE13.PinAttribute=CortexM7
PH15.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin6=PC10
Mcu.Pin7=PI1
PJ8.GPIOParameters=GPIO_Label,PinAttribute
Mcu.Pin8=PI0
Mcu.Pin9=PI7
PI13.Signal=GPIO_Output
PC2.PinAttribute=CortexM7
PC2_C.Signal=ADC3_INP0
SH.FMC_A10.0=FMC_A10,13b-sda1
Mcu.Pin0=PI6
Mcu.Pin1=PI5
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PI4
PF14.PinAttribute=CortexM7
Mcu.Pin3=PB5
PK3.Locked=true
Mcu.Pin4=PK5
PD10.GPIOParameters=GPIO_Label,PinAttribute
PB0.PinAttribute=CortexM7
Mcu.Pin5=PG9
ADC3.SamplingTime-1\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
LWIP0.BSP.condition=
SH.FMC_D8_DA8.0=FMC_D8,sd-32b-d1
Dma.DAC1_CH1.0.SignalID=NONE
PG14.PinAttribute=CortexM7
PI8.Signal=GPIO_Input
SH.FMC_D2_DA2.0=FMC_D2,sd-32b-d1
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ACCESS_CACHEABLE
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-ALGOBUILD.1.2.0
PD0.PinAttribute=CortexM7
PE13.Signal=FMC_D10_DA10
RCC.PLL1_VCI_Range-AdvancedSettings=RCC_PLL1VCIRANGE_1
PF3.PinAttribute=CortexM7
PF7.GPIO_Label=QSPI_BK1_IO2
DSI_D1N.GPIOParameters=PinAttribute
PI5.Locked=true
PI5.Signal=FMC_NBL3
PI0.Signal=FMC_D24
Dma.DAC1_CH1.0.Mode=DMA_CIRCULAR
PI8.PinAttribute=Free
File.Version=6
PA10.GPIO_Label=STLINK_TX
SH.FMC_D5_DA5.ConfNb=1
PH3.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D2_DA2.ConfNb=1
PG13.Mode=RMII
PE4.Mode=SAI_A_MasterWithClock
PK6.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_SDNRAS.0=FMC_SDNRAS,13b-sda1
PF7.PinAttribute=CortexM7
PE4.Signal=SAI1_FS_A
PE6.GPIOParameters=GPIO_Label,PinAttribute
Dma.RequestsNb=1
PC2_C.Locked=true
PI12.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.ProjectName=SSS_MOD-747DISCO
PD7.GPIO_Label=SPDIF_RX0
PH7.Mode=SdramChipSelect2_1
RCC.APB3Freq_Value=120000000
PC2_C.PinAttribute=CortexM7
DSI_D1P.PinAttribute=CortexM7
LWIP0.BSP.component=LAN8742
SPI5.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_2
PJ9.PinAttribute=CortexM7
PA7.Locked=true
PJ9.Signal=UART8_RX
SH.FMC_D0_DA0.0=FMC_D0,sd-32b-d1
RCC.D1PPRE=RCC_APB3_DIV2
PJ12.Signal=GPIO_Output
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x30040000
PK0.GPIO_Label=ARD_D13
PA2.GPIO_Label=ETH_MDIO
PD14.Locked=true
PG8.PinAttribute=CortexM7
PF5.GPIO_Label=FMC_A5
SH.FMC_A9.0=FMC_A9,13b-sda1
VP_TIM13_VS_ClockSourceINT.Signal=TIM13_VS_ClockSourceINT
PJ1.Signal=GPIO_Input
SH.FMC_D4_DA4.0=FMC_D4,sd-32b-d1
PI12.GPIO_Label=LED1
Dma.DAC1_CH1.0.Instance=DMA1_Stream0
DSI_CKP.Signal=DSIHOST_CKP
PE0.GPIO_Label=FMC_NBL0
PF5.Signal=FMC_A5
PH3.GPIO_Label=QSPI_BK2_IO1
PH7.Signal=FMC_SDCKE1
PJ3.GPIO_Label=ARD_D2
PK2.GPIO_Label=JOY_SEL
SH.FMC_D19.ConfNb=1
PC4.Locked=true
SH.FMC_D30.0=FMC_D30,sd-32b-d1
PG13.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PJ7.Mode=Output Compare2 CH2 CH2N
SPI2.Direction=SPI_DIRECTION_2LINES
PF0.Signal=FMC_A0
PI2.GPIO_Label=FMC_D26
SH.FMC_NBL0.ConfNb=1
SH.COMP_DAC11_group.ConfNb=1
PF11.PinAttribute=CortexM7
PE3.Mode=SAI_B_SPDIF
PC2.GPIO_Label=PMOD\#3
RCC.Tim2OutputFreq_Value=240000000
VP_LWIP_VS_Enabled.Signal=LWIP_VS_Enabled
PG4.PinAttribute=CortexM7
RCC.DFSDMACLkFreq_Value=49142857.14285714
PH14.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_A12.0=FMC_A12,13b-sda1
PA2.Locked=true
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
NVIC1.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PI6.PinAttribute=CortexM7
PE8.GPIOParameters=GPIO_Label,PinAttribute
PK2.Signal=GPIO_Input
SH.FMC_A9.ConfNb=1
CORTEX_M7.CPU_ICache=Enabled
PA7.Mode=RMII
PC10.GPIO_Label=SDIO1_D2
PH11.Signal=FMC_D19
ProjectManager.NoMain=false
PG3.Signal=GPIO_Output
PG1.Signal=FMC_A11
PG1.Locked=true
PJ0.PinAttribute=CortexM7
RCC.SAI4BFreq_Value=192000000
SH.FMC_SDCLK.ConfNb=1
PI14.PinAttribute=Free
PC4.Signal=ETH_RXD0
PI14.GPIOParameters=GPIO_Label,PinAttribute
NVIC1.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
PI10.Signal=FMC_D31
PK0.Locked=true
DSI_D1P.GPIOParameters=PinAttribute
PJ7.PinAttribute=CortexM7
VP_RNG_VS_RNG.Mode=RNG_Activate
PI13.GPIOParameters=GPIO_Label,PinAttribute
VP_LWIP_VS_Enabled.Mode=Enabled
LWIP.GATEWAY_ADDRESS=000.000.000.000
NVIC1.ETH_IRQn=true\:0\:0\:false\:false\:true\:true\:true
PC0.Mode=Device_HS
PJ9.Locked=true
PJ11.Mode=Full_Duplex_Master
PB13.PinAttribute=CortexM7
PE9.GPIOParameters=GPIO_Label,PinAttribute
PC14-OSC32_IN\ (OSC32_IN).Locked=true
RCC.DSITXEscFreq_Value=15625000
RCC.SPI6Freq_Value=120000000
PH13.GPIO_Label=FMC_D21
PC8.GPIO_Label=SDIO1_D0
PC12.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D21.0=FMC_D21,sd-32b-d1
PF7.Mode=Dual_Bank
PH8.GPIO_Label=FMC_D16
SH.FMC_NBL3.ConfNb=1
RCC.SPI45Freq_Value=120000000
NVIC1.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PE15.GPIO_Label=FMC_D12
PH4.Signal=USB_OTG_HS_ULPI_NXT
PK7.GPIOParameters=GPIO_Label,PinAttribute
ProjectManager.TargetToolchain=STM32CubeIDE
PH14.PinAttribute=CortexM7
PE7.GPIOParameters=GPIO_Label,PinAttribute
CORTEX_M7.TypeExtField-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_TEX_LEVEL1
SH.FMC_D1_DA1.ConfNb=1
PE11.PinAttribute=CortexM7
PC14-OSC32_IN\ (OSC32_IN).PinAttribute=CortexM7
PF15.Locked=true
PB2.GPIOParameters=GPIO_Label,PinAttribute
PH5.PinAttribute=CortexM7
PJ9.GPIO_Label=ARD_D0
NVIC1.ForceEnableDMAVector=true
PC15-OSC32_OUT\ (OSC32_OUT).GPIOParameters=GPIO_Label,PinAttribute
PE4.Locked=true
PF2.Signal=FMC_A2
PC4.PinAttribute=CortexM7
PC2.Locked=true
ProjectManager.RegisterCallBack=
PF5.GPIOParameters=GPIO_Label,PinAttribute
PH2.GPIOParameters=GPIO_Label,PinAttribute
PH11.Locked=true
SH.FMC_D28.ConfNb=1
PG7.Mode=SAI_A_MasterWithClock
PE11.Signal=FMC_D8_DA8
LWIP0.BSP.api=BSP_COMPONENT_DRIVER
PK0.Signal=SPI5_SCK
PB1.Locked=true
PG9.GPIO_Label=QSPI_BK2_IO2
PG14.Signal=QUADSPI_BK2_IO3
SH.ADCx_INP0.0=ADC1_INP0,IN0-Single-Ended
PJ10.GPIO_Label=ARD_D11
PB0.Mode=Device_HS
SAI1.IPParameters=Instance-SAI_A_MasterWithClock,VirtualMode-SAI_A_MasterWithClock,MClockEnable-SAI_A_MasterWithClock,RealAudioFreq-SAI_A_MasterWithClock,ErrorAudioFreq-SAI_A_MasterWithClock,Instance-SAI_B_SPDIF,VirtualMode-SAI_B_SPDIF,RealAudioFreq-SAI_B_SPDIF,AudioFrequency-SAI_A_MasterWithClock
PG1.GPIO_Label=FMC_A11
PB5.PinAttribute=CortexM7
PD11.GPIOParameters=GPIO_Label,PinAttribute
RCC.VCOInput1Freq_Value=5000000
PI8.Locked=true
RCC.APB2Freq_Value=120000000
PG4.GPIOParameters=GPIO_Label,PinAttribute
SH.FMC_D13_DA13.ConfNb=1
PI3.Locked=true
PC13.GPIOParameters=GPIO_Label,PinAttribute
PF10.Signal=ADC3_INP6
CORTEX_M7.IsShareable-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_ACCESS_SHAREABLE
Dma.DAC1_CH1.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PI7.GPIO_Label=FMC_D29
PF15.Signal=FMC_A9
PD14.GPIO_Label=FMC_D0
PA4.GPIOParameters=PinAttribute
PF0.Locked=true
PE6.Signal=SAI1_SD_A
PB15.GPIOParameters=GPIO_Label,PinAttribute
PD11.PinAttribute=CortexM7
PE11.Locked=true
Mcu.Name=STM32H747XIHx
PA4.PinAttribute=CortexM7
RCC.PLL3_VCI_Range-AdvancedSettings=RCC_PLL3VCIRANGE_3
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region0_Settings=MPU_REGION_SIZE_256B
Dma.DAC1_CH1.0.SyncEnable=DISABLE
SH.FMC_D23.ConfNb=1
PE6.PinAttribute=CortexM7
PA2.Signal=ETH_MDIO
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_FULL_ACCESS
PC13.PinAttribute=CortexM7
PD14.Signal=FMC_D0_DA0
PA7.GPIO_Label=ETH_CRS_DV
PA12.Mode=Full_Duplex_Master
PG12.Locked=true
LWIP.BSP.number=1
PC14-OSC32_IN\ (OSC32_IN).Signal=RCC_OSC32_IN
PC5.GPIO_Label=ETH_RXD1
SH.FMC_D23.0=FMC_D23,sd-32b-d1
PG6.PinAttribute=CortexM7
PJ4.Locked=true
DSI_CKN.GPIOParameters=PinAttribute
NVIC2.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PF6.GPIOParameters=GPIO_Label,PinAttribute
PG12.GPIO_Label=ETH_TXD1
VP_LTDC_DSIMode.Mode=RGB888
PH2.Locked=true
RCC.SAI4AFreq_Value=192000000
ADC1.NbrOfConversionFlag=1
PI15.Signal=GPIO_Output
PC15-OSC32_OUT\ (OSC32_OUT).PinAttribute=CortexM7
RCC.DIVQ1Freq_Value=192000000
PC2_C.GPIOParameters=GPIO_Label,PinAttribute
PE3.GPIO_Label=SAI1_SD_B
RCC.D3PPRE=RCC_APB4_DIV2
PC9.Signal=SDMMC1_D1
RCC.VCOInput2Freq_Value=1000000
RCC.APB1Freq_Value=120000000
PJ11.GPIOParameters=GPIO_Label,PinAttribute
PB11.Locked=true
NVIC2.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeviceId=STM32H747XIHx
ProjectManager.LibraryCopy=1
SPI5.Direction=SPI_DIRECTION_2LINES
PB1.GPIOParameters=GPIO_Label,PinAttribute
PJ12.Locked=true
PA7.Signal=ETH_CRS_DV
PF2.GPIO_Label=FMC_A2
isbadioc=false
